kepler-444b/GD_gd32e230c8t6/Source/device/panel_key.c
#include "panel_key.h"
#include "device_manager.h"
#include <float.h>
#include "gd32e23x.h"
#include "FreeRTOS.h"
#include "timers.h"
#include "../base/debug.h"
#include "../base/base.h"
#include "../adc/adc.h"
#include "../gpio/gpio.h"
#include "../uart/uart.h"
#include "../base/panel_base.h"
#include "../eventbus/eventbus.h"
#include "../protocol/protocol.h"
#include "../pwm/pwm.h"
#include "../config/config.h"

#if defined PANEL_KEY

#define ADC_TO_VOLTAGE(adc_val) ((adc_val) * 330 / 4096) // adc值转电压
#define ADC_VALUE_COUNT         10                       // 电压值缓冲区数量

#define DEFAULT_MIN_VALUE       329 // 无按键按下时的最小电压值
#define DEFAULT_MAX_VALUE       330 // 无按键按下时的最大电压值

#define SHORT_TIME_LED          50    // 短亮时间
#define SHORT_TIME_RELAY        30000 // 继电器导通时间

typedef struct {
    // 用于处理adc数据
    bool buf_full;   // 缓冲区填满标志位
    uint8_t buf_idx; // 缓冲区下标
    uint16_t vol;    // 电压值
    uint16_t vol_buf[ADC_VALUE_COUNT];
} adc_value_t;

typedef struct {
    // 设置每个按键的电压范围
    uint16_t min;
    uint16_t max;
} key_vol_t;

typedef struct {     // 用于每个按键的状态
    bool key_press;  // 按键按下
    bool key_status; // 按键状态

    bool led_w_open;  // 白灯状态
    bool led_w_short; // 启用短亮(窗帘开关)
    bool led_w_last;  // 白灯上次状态

    bool led_y_open; // 黄灯状态
    bool led_y_last; // 黄灯上次状态

    bool relay_open;  // 继电状态
    bool relay_short; // 继电器短开
    bool relay_last;  // 继电器上次状态

    uint16_t led_w_short_count; // 短亮计数器
    uint32_t relay_open_count;  // 继电器导通计数器
    key_vol_t vol_range;        // 按键电压范围

} panel_status_t;

typedef struct
{
    bool led_filck;      // 闪烁
    bool key_long_press; // 长按状态
    bool enter_config;   // 进入配置状态
    uint8_t back_status; // 所有背光灯状态(0:关闭,1:打开,2:低亮)
    uint8_t back_status_last;
    uint16_t key_long_count;  // 长按计数
    uint16_t led_filck_count; // 闪烁计数
} common_panel_t;

static common_panel_t my_common_panel;
static adc_value_t my_adc_value;

static panel_status_t my_panel_status[KEY_NUMBER_COUNT] = {

#if defined PANEL_6KEY
    [0] = {.vol_range = {0, 15}},
    [1] = {.vol_range = {25, 45}},
    [2] = {.vol_range = {85, 110}},
    [3] = {.vol_range = {145, 155}},
    [4] = {.vol_range = {195, 210}},
    [5] = {.vol_range = {230, 255}},
#endif

#if defined PANEL_8KEY
    [0] = {.vol_range = {0, 15}},
    [1] = {.vol_range = {25, 45}},
    [2] = {.vol_range = {85, 110}},
    [3] = {.vol_range = {145, 155}},
#endif
};

#if defined PANEL_8KEY // 8键采用两组4键的方式
static common_panel_t my_common_panel_ex;
static adc_value_t my_adc_value_ex;
static panel_status_t my_panel_status_ex[KEY_NUMBER_COUNT] = {
    [0] = {.vol_range = {0, 15}},
    [1] = {.vol_range = {25, 45}},
    [2] = {.vol_range = {85, 110}},
    [3] = {.vol_range = {165, 175}},
};

#endif

// 函数声明
static void panel_gpio_init(void);
static void panel_power_status(void);
static void panel_check_key_status(void);
static void panel_data_cb(valid_data_t *data);
static void panel_read_adc(TimerHandle_t xTimer);
static void panel_proce_cmd(TimerHandle_t xTimer);
static void panel_ctrl_led_all(bool led_state, bool is_ex);
static void panel_event_handler(event_type_e event, void *params);
static void process_led_flicker(common_panel_t *common_panel, bool is_ex_panel);
static void process_exe_status(const panel_cfg_t *temp_cfg, panel_status_t *temp_status);
static void process_cmd_check(valid_data_t *data, const panel_cfg_t *temp_cfg, panel_status_t *temp_status);
static void process_panel_adc(panel_status_t *panel_status, common_panel_t *common_panel, adc_value_t *adc_value, bool is_ex);

void panel_key_init(void)
{
    panel_gpio_init();
    adc_channel_t my_adc_channel = {0};
    app_pwm_init(); // 初始化 PWM 模块
#if defined PANEL_4KEY

#endif

#if defined PANEL_6KEY
    my_adc_channel.adc_channel_0 = true;
    app_adc_init(&my_adc_channel);

    app_pwm_add_pin(PA8);
    app_set_pwm_fade(PA8, 500, 3000);
#endif

#if defined PANEL_8KEY
    my_adc_channel.adc_channel_0 = true;
    my_adc_channel.adc_channel_1 = true;
    app_adc_init(&my_adc_channel);

    for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
        app_pwm_add_pin(app_get_panel_cfg()[i].led_y_pin);
        app_pwm_add_pin(app_get_panel_cfg_ex()[i].led_y_pin);
    };

    for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) { // 上电点亮所有背光灯
        app_set_pwm_fade(app_get_panel_cfg()[i].led_y_pin, 500, 3000);
        app_set_pwm_fade(app_get_panel_cfg_ex()[i].led_y_pin, 500, 3000);
    }
#endif
    panel_power_status();

    app_eventbus_subscribe(panel_event_handler); // 订阅事件总线
    // 创建一个静态定时器用于读取adc值
    static StaticTimer_t ReadAdcStaticBuffer;
    static TimerHandle_t ReadAdcTimerHandle = NULL;
    // 创建一个定时器用于处理命令
    static StaticTimer_t PanelStaticBuffer;
    static TimerHandle_t PanleTimerHandle = NULL;

    // 集中处理adc
    ReadAdcTimerHandle = xTimerCreateStatic("ReadAdcTimer", 1, true, NULL, panel_read_adc, &ReadAdcStaticBuffer);
    // 集中状态机轮询
    PanleTimerHandle = xTimerCreateStatic("PanelTimer", 1, true, NULL, panel_proce_cmd, &PanelStaticBuffer);

    if (xTimerStart(PanleTimerHandle, 0) != true || xTimerStart(ReadAdcTimerHandle, 0) != true) {
        // 启动定时器(0表示不阻塞)
        APP_ERROR("timer_start error");
    }
    APP_PRINTF("panel_key_init\n");
}

static void panel_gpio_init(void)
{
    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_GPIOB);

#if defined PANEL_4KEY

#endif

#if defined PANEL_6KEY
    gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_8); // 背光灯 GPIOA8

    gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_15); // 6个白灯
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_3);
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_4);
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_5);
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_6);
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_8);

    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_12); // 4个继电器
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_13);
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_14);
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_15);
#endif

#if defined PANEL_8KEY
    // 8 个黄灯
    gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_4);
    gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_5);
    gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_6);
    gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_7);
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_6);
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_7);
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_8);
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_9);
    // 8 个白灯
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_0);
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_1);
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_2);
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_10);
    gpio_mode_set(GPIOA, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_15);
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_3);
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_4);
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_5);
    // 4 s个继电器
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_12);
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_13);
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_14);
    gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE, GPIO_PIN_15);
#endif
}

static void panel_read_adc(TimerHandle_t xTimer)
{
    my_adc_value.vol = ADC_TO_VOLTAGE(app_get_adc_value()[0]);
    process_panel_adc(my_panel_status, &my_common_panel, &my_adc_value, false);
    if (my_common_panel.led_filck == true) {
        process_led_flicker(&my_common_panel, false);
    }

#if defined PANEL_8KEY
    my_adc_value_ex.vol = ADC_TO_VOLTAGE(app_get_adc_value()[1]);
    process_panel_adc(my_panel_status_ex, &my_common_panel_ex, &my_adc_value_ex, true);
    if (my_common_panel_ex.led_filck == true) {
        process_led_flicker(&my_common_panel_ex, true);
    }
#endif
}

