kepler-444b/GD_gd32e230c8t6/Source/device/panel_key.c
static void process_cmd_check(valid_data_t *data, const panel_cfg_t *temp_cfg, panel_status_t *temp_status)
{
    switch (data->data[1]) {

        case ALL_CLOSE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if ((temp_cfg[i].key_area >> 4) == (data->data[4] >> 4) ||
                    (data->data[4] >> 4) == 0xF) {         // 匹配"总关区域"(若为0xF则可以控制所有总关区域)
                    if (temp_cfg[i].key_func == 0x0F) {    // 匹配"夜灯"
                        if (temp_cfg[i].key_perm & 0x20) { // "夜灯"受"总关"控制
                            temp_status[i].key_status = data->data[2];
                            temp_status[i].led_w_open = data->data[2];
                            temp_status[i].relay_open = data->data[2];
                        }
                    } else if (temp_cfg[i].key_func == 0x0D ||
                               temp_cfg[i].key_func == 0x0E ||
                               temp_cfg[i].key_func == 0x01) { // 匹配"场景""灯控""总关"

                        if (temp_cfg[i].key_perm & 0x20) { // 受"总关"控制
                            temp_status[i].key_status = false;
                            temp_status[i].led_w_open = false;
                            temp_status[i].relay_open = false;
                        }
                    }
                    if (temp_cfg[i].key_func == data->data[1] &&
                        temp_cfg[i].key_group == data->data[3] &&
                        temp_cfg[i].key_group != 0x00) { // 匹配双控

                        temp_status[i].led_w_short = true;
                        temp_status[i].relay_open  = data->data[2];
                        temp_status[i].key_status  = data->data[2];
                    }
                }
            }
        } break;
        case ALL_ON_OFF: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if ((temp_cfg[i].key_area >> 4) == (data->data[4] >> 4) ||
                    (data->data[4] >> 4 == 0xF)) { // 匹配"总关区域"(若为0xF则可以控制所有总关区域)
                    if (temp_cfg[i].key_func == 0x0F) {
                        if (temp_cfg[i].key_perm & 0x01) {
                            temp_status[i].key_status = !data->data[2];
                            temp_status[i].led_w_open = !data->data[2];
                            temp_status[i].relay_open = !data->data[2];
                        }
                    } else if (temp_cfg[i].key_func == 0x0D ||
                               temp_cfg[i].key_func == 0x0E ||
                               temp_cfg[i].key_func == 0x01) {

                        if (temp_cfg[i].key_perm & 0x01) {
                            temp_status[i].key_status = data->data[2];
                            temp_status[i].led_w_open = data->data[2];
                            temp_status[i].relay_open = data->data[2];
                        }
                    }
                    if (temp_cfg[i].key_func == 0x00) {
                        // 匹配到总关(短亮)
                        temp_status[i].led_w_short = true;
                        temp_status[i].relay_open  = data->data[2];
                        temp_status[i].key_status  = data->data[2];
                    }
                    if (temp_cfg[i].key_func == data->data[1] &&
                        temp_cfg[i].key_group == data->data[3] &&
                        temp_cfg[i].key_group != 0x00) {
                        // 匹配双控
                        temp_status[i].led_w_open = data->data[2];
                        temp_status[i].relay_open = data->data[2];
                        temp_status[i].key_status = data->data[2];
                    }
                }
            }

        } break;
        case CLEAN_ROOM: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == data->data[1] &&
                    temp_cfg[i].key_group == data->data[3] &&
                    temp_cfg[i].key_group != 0x00) {
                    temp_status[i].led_w_open = data->data[2];
                    temp_status[i].relay_open = data->data[2];
                    temp_status[i].key_status = data->data[2];
                    if (data->data[2] == true) { // 开启"清理房间"关闭"请勿打扰"
                        for (uint8_t j = 0; j < KEY_NUMBER_COUNT; j++) {
                            if (temp_cfg[j].key_func == 0x03) {
                                temp_status[j].led_w_open = false;
                                temp_status[j].relay_open = false;
                                temp_status[j].key_status = false;
                            }
                        }
                    }
                }
            }

        } break;
        case DND_MODE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == data->data[1] &&
                    temp_cfg[i].key_group == data->data[3] &&
                    temp_cfg[i].key_group != 0x00) {
                    temp_status[i].led_w_open = data->data[2];
                    temp_status[i].relay_open = data->data[2];
                    temp_status[i].key_status = data->data[2];
                    if (data->data[2] == true) { // 开启"请勿打扰"关闭"清理房间"
                        for (uint8_t j = 0; j < KEY_NUMBER_COUNT; j++) {
                            if (temp_cfg[j].key_func == 0x02) {
                                temp_status[j].led_w_open = false;
                                temp_status[j].relay_open = false;
                                temp_status[j].key_status = false;
                            }
                        }
                    }
                }
            }

        } break;
        case LATER_MODE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == data->data[1] &&
                    temp_cfg[i].key_group == data->data[3] &&
                    temp_cfg[i].key_group != 0x00) {
                    temp_status[i].led_w_open = data->data[2];
                    temp_status[i].relay_open = data->data[2];
                    temp_status[i].key_status = data->data[2];
                }
            }

