kepler-444b/GD_gd32e230c8t6/Source/device/panel_key.c
        } break;
        case CHECK_OUT: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == data->data[1] &&
                    temp_cfg[i].key_group == data->data[3] &&
                    temp_cfg[i].key_group != 0x00) {
                    temp_status[i].led_w_open = data->data[2];
                    temp_status[i].relay_open = data->data[2];
                    temp_status[i].key_status = data->data[2];
                }
            }

        } break;
        case SOS_MODE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == data->data[1] &&
                    temp_cfg[i].key_group == data->data[3] &&
                    temp_cfg[i].key_group != 0x00) {
                    temp_status[i].led_w_open = data->data[2];
                    temp_status[i].relay_open = data->data[2];
                    temp_status[i].key_status = data->data[2];
                }
            }

        } break;
        case SERVICE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == data->data[1] &&
                    temp_cfg[i].key_group == data->data[3] &&
                    temp_cfg[i].key_group != 0x00) {
                    temp_status[i].led_w_open = data->data[2];
                    temp_status[i].relay_open = data->data[2];
                    temp_status[i].key_status = data->data[2];
                }
            }

        } break;
        case CURTAIN_OPEN: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                // 检查功能匹配和分组匹配
                if (temp_cfg[i].key_func == data->data[1] &&
                    temp_cfg[i].key_group == data->data[3] &&
                    temp_cfg[i].key_group != 0x00) {
                    for (uint8_t j = 0; j < KEY_NUMBER_COUNT; j++) {
                        // 关闭同分组的"窗帘关"
                        if (temp_cfg[j].key_func == CURTAIN_CLOSE &&
                            temp_cfg[j].key_group == data->data[3]) {
                            temp_status[j].relay_open  = false;
                            temp_status[j].relay_short = false;
                        }
                    }
                    temp_status[i].led_w_short = true; // 短亮
                    temp_status[i].relay_short = true; // 继电器导通 30s
                }
            }
        } break;
        case CURTAIN_CLOSE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                // 检查功能匹配和分组匹配
                if (temp_cfg[i].key_func == data->data[1] &&
                    temp_cfg[i].key_group == data->data[3] &&
                    temp_cfg[i].key_group != 0x00) {
                    for (uint8_t j = 0; j < KEY_NUMBER_COUNT; j++) {
                        // 关闭同分组的"窗帘开"
                        if (temp_cfg[j].key_func == CURTAIN_OPEN &&
                            temp_cfg[j].key_group == data->data[3]) {
                            temp_status[j].relay_open  = false;
                            temp_status[j].relay_short = false;
                        }
                    }
                    temp_status[i].led_w_short = true;
                    temp_status[i].relay_short = true;
                }
            }
        } break;

        case SCENE_MODE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {

                if ((((temp_cfg[i].key_area & NIGHT_LIGHT) == (data->data[4] & NIGHT_LIGHT)) ||
                     ((data->data[4] & NIGHT_LIGHT) == 0xF)) &&
                    (temp_cfg[i].key_func == data->data[1])) {          // 匹配"场景区域"(若为0xF则可以控制所有场景区域)和"按键功能"
                    if (temp_cfg[i].key_scene_group == data->data[7]) { // 匹配"场景分组"
                        for (uint8_t j = 0; j < KEY_NUMBER_COUNT; j++) {
                            if (temp_cfg[j].key_func == SCENE_MODE &&
                                (((temp_cfg[j].key_area & NIGHT_LIGHT) == (data->data[4] & NIGHT_LIGHT)) ||
                                 ((data->data[4] & NIGHT_LIGHT) == 0xF))) { // 关闭同"场景区域"的其他分组
                                temp_status[j].led_w_open = false;
                                temp_status[j].relay_open = false;
                                temp_status[j].key_status = false;
                            }
                        }
                        temp_status[i].led_w_open = data->data[2];
                        temp_status[i].relay_open = data->data[2];
                        temp_status[i].key_status = data->data[2];
                    }
                }
            }

        } break;
        case LIGHT_MODE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == data->data[1] &&
                    temp_cfg[i].key_group == data->data[3] &&
                    temp_cfg[i].key_group != 0x00) {

                    temp_status[i].led_w_open = data->data[2];
                    temp_status[i].relay_open = data->data[2];
                    temp_status[i].key_status = data->data[2];
                }
            }

        } break;
        case NIGHT_LIGHT: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == data->data[1] &&
                    temp_cfg[i].key_group == data->data[3] &&
                    temp_cfg[i].key_group != 0x00) {
                    temp_status[i].led_w_open = data->data[2];
                    temp_status[i].relay_open = data->data[2];
                    temp_status[i].key_status = data->data[2];
                }
            }

        } break;
        case LIGHT_UP:
            break;
        case LIGHT_DOWN:
            break;
        case DIMMING_3:
            break;
        case DIMMING_4:
            break;
        case UNLOCKING:
            break;
        case BLUETOOTH:
            break;
        case CURTAIN_STOP: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_group == data->data[3] &&
                    temp_cfg[i].key_group != 0x00 &&
                    temp_status[i].relay_short == true) { // 匹配分组后如果该继电器正在动作才能触发暂停
                    temp_status[i].led_w_short = true;
                    temp_status[i].relay_short = false;
                    temp_status[i].relay_open  = false;
                }
            }
        } break;
        case VOLUME_ADD:
            break;
        case VOLUME_SUB:
            break;
        case PLAY_PAUSE:
            break;
        case NEXT_SONG:
            break;
        case LAST_SONG:
            break;
        default:
            return;
    }
}

