kepler-444b/GD_gd32e230c8t6/Source/device/panel_key.c
static void panel_ctrl_led_all(bool led_state, bool is_ex)
{
    panel_status_t *temp = NULL;
#ifndef PANEL_8KEY
    temp = my_panel_status;
#endif
#if defined PANEL_8KEY
    temp = is_ex ? my_panel_status_ex : my_panel_status;
#endif
    for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
        temp[i].led_w_open = led_state;
    }
}

static void panel_event_handler(event_type_e event, void *params)
{
    switch (event) {
        case EVENT_ENTER_CONFIG: {
            panel_ctrl_led_all(true, false);
            my_common_panel.enter_config = true;
        } break;
        case EVENT_EXIT_CONFIG: {
            panel_ctrl_led_all(false, false);
            my_common_panel.enter_config = false;
            NVIC_SystemReset(); // 退出"配置模式"后触发软件复位
        } break;
        case EVENT_SAVE_SUCCESS: {
            my_common_panel.led_filck = true;
        } break;
#if defined PANEL_8KEY
        case EVENT_ENTER_CONFIG_EX:
            panel_ctrl_led_all(true, true);
            my_common_panel_ex.enter_config = true;
            break;
        case EVENT_EXIT_CONFIG_EX: {
            panel_ctrl_led_all(false, true);
            my_common_panel_ex.enter_config = false;
            NVIC_SystemReset();
        } break;
        case EVENT_SAVE_SUCCESS_EX: {
            my_common_panel_ex.led_filck = true;
        } break;
#endif
        case EVENT_RECEIVE_CMD: {
            valid_data_t *valid_data = (valid_data_t *)params;
            panel_data_cb(valid_data);
        } break;
        default:
            return;
    }
}

// 执行上电参数(迎宾)
static void panel_power_status(void)
{
    const panel_cfg_t *temp_cfg = app_get_panel_cfg();

    for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
        if (temp_cfg[i].key_perm & 0x08) { // 权限是否勾选"迎宾"
            my_panel_status[i].led_w_open = true;
            my_panel_status[i].relay_open = true;
            my_panel_status[i].key_status = true;
        }
    }
#if defined PANEL_8KEY
    const panel_cfg_t *temp_cfg_ex = app_get_panel_cfg_ex();
    for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
        if (temp_cfg_ex[i].key_perm & 0x08) { // 权限是否勾选"迎宾"
            my_panel_status_ex[i].led_w_open = true;
            my_panel_status_ex[i].relay_open = true;
            my_panel_status_ex[i].key_status = true;
        }
    }
#endif
}

#endif